#Contents List
##Import Libraries 
##Create Path 
##Import CSV 5.4-PigEBank-Client-Data set
##Permanantly dropping columns Row_Number and Last_Name from 5.4-PigEBank-Client-Data set.csv
##Changing data type on column Customer_ID from a number to a string 
##Finding missing values in df_client dataframe
##View 3 missing values in Credit Score
##Imput the mean Credit Score to replace NaN's
##View missing values in Gender
##Imput the mode Gender to replace NaN
##View missing values in Age
##Imput the median Age to replace NaN
##Changing data type on column Age from a float to a number
##View missing values in Estimated Salary
##Imput 0's in the Estimated Salary column to replace NaN
##Finding missing values in df_client dataframe
##View missing values in Gender
##Imput Male in the Gender column to replace NaN (Male is the mode gender)
##Finding missing values in df_client dataframe
##Strip whitespace off column Estimated Salary
##Strip '$' and',' off the Estimated Salary Column. 
##Changing data type on column Estimated Salary from a sting to a float
##Strip '$' and',' off the Balance Column. 
##Changing data type on column Balance from a sting to a float
##Changing data type on column HasCrCard? from a number to a string 
##Changing data type on column IsActiveMember from a number to a string 
##Changing data type on column ExitedFromBank? from a number to a string 
##Changing data type on column Credit Score from a float to a number
##Imput the median Estimated Salary to replace NaN
##Finding missing values in df_client_updated dataframe
##Check for mixed types
##Finding duplicates
###Export final cleaned df_client_updated

In [1]:
#Import Libraries
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

In [2]:
#Path
path = r'C:\Users\Family Computer\Documents\Data Analytics\Pig E Bank Analysis'

In [7]:
#Import CSV 5.4-PigEBank-Client-Data set
df_client=pd.read_csv(os.path.join(path,'02 Data', 'Original Data', '5.4-PigEBank-Client-Data set.csv'))

In [8]:
df_client.head()

,Row_Number,Customer_ID,Last_Name,Credit Score,Country,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard?,IsActiveMember,Estimated Salary,ExitedFromBank?
0,1,15634602,Hargrave,619.0,France,Female,42.0,2,$0.00,1,1,1,"$101,348.88",1
1,2,15647311,Hill,608.0,Spain,Female,41.0,1,"$83,807.86",1,0,1,"$112,542.58",0
2,3,15619304,Onio,502.0,France,Female,42.0,8,"$159,660.80",3,1,0,"$113,931.57",1
3,4,15701354,Boni,699.0,France,Female,39.0,1,$0.00,2,0,0,"$93,826.63",0
4,5,15737888,Mitchell,850.0,Spain,Female,43.0,2,"$125,510.82",1,1,1,"$79,084.10",0

In [10]:
df_client.shape

(991, 14)

In [12]:
df_client.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 991 entries, 0 to 990
Data columns (total 14 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Row_Number        991 non-null    int64
 1   Customer_ID       991 non-null    int64
 2   Last_Name         990 non-null    object
 3   Credit Score      988 non-null    float64
 4   Country           991 non-null    object
 5   Gender            990 non-null    object
 6   Age               990 non-null    float64
 7   Tenure            991 non-null    int64
 8   Balance           991 non-null    object
 9   NumOfProducts     991 non-null    int64
 10  HasCrCard?        991 non-null    int64
 11  IsActiveMember    991 non-null    int64
 12  Estimated Salary  989 non-null    object
 13  ExitedFromBank?   991 non-null    int64
dtypes: float64(2), int64(7), object(5)
memory usage: 108.5+ KB

In [13]:
df_client.dtypes

Row_Number            int64
Customer_ID           int64
Last_Name            object
Credit Score        float64
Country              object
Gender               object
Age                 float64
Tenure                int64
Balance              object
NumOfProducts         int64
HasCrCard?            int64
IsActiveMember        int64
Estimated Salary     object
ExitedFromBank?       int64
dtype: object

In [14]:
df_client.describe()

,Row_Number,Customer_ID,Credit Score,Age,Tenure,NumOfProducts,HasCrCard?,IsActiveMember,ExitedFromBank?
count,991.00000,9.910000e+02,988.000000,990.000000,991.000000,991.000000,991.000000,991.000000,991.000000
mean,496.00000,1.569232e+07,648.512146,38.684848,5.066599,1.522704,0.706357,0.507568,0.205853
std,286.22136,7.223333e+04,98.202853,10.958220,2.928371,0.573170,0.455660,0.500195,0.404527
min,1.00000,1.556609e+07,376.000000,2.000000,0.000000,1.000000,0.000000,0.000000,0.000000
25%,248.50000,1.563019e+07,579.750000,32.000000,2.000000,1.000000,0.000000,0.000000,0.000000
50%,496.00000,1.569275e+07,653.500000,37.000000,5.000000,1.000000,1.000000,1.000000,0.000000
75%,743.50000,1.575379e+07,721.000000,44.000000,8.000000,2.000000,1.000000,1.000000,0.000000
max,991.00000,1.581536e+07,850.000000,82.000000,10.000000,4.000000,1.000000,1.000000,1.000000

In [25]:
#Permanantly dropping columns Row_Number and Last_Name from 5.4-PigEBank-Client-Data set.csv
df_client = df_client.drop(columns = ['Row_Number', 'Last_Name'])

KeyError: "['Row_Number', 'Last_Name'] not found in axis"

In [26]:
df_client.head()

,Customer_ID,Credit Score,Country,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard?,IsActiveMember,Estimated Salary,ExitedFromBank?
0,15634602,619.0,France,Female,42.0,2,$0.00,1,1,1,"$101,348.88",1
1,15647311,608.0,Spain,Female,41.0,1,"$83,807.86",1,0,1,"$112,542.58",0
2,15619304,502.0,France,Female,42.0,8,"$159,660.80",3,1,0,"$113,931.57",1
3,15701354,699.0,France,Female,39.0,1,$0.00,2,0,0,"$93,826.63",0
4,15737888,850.0,Spain,Female,43.0,2,"$125,510.82",1,1,1,"$79,084.10",0

In [16]:
#Changing data type on column Customer_ID from a number to a string 
df_client['Customer_ID'] = df_client['Customer_ID'].astype('str')

In [17]:
df_client['Customer_ID'].dtype

dtype('O')

In [27]:
#Finding missing values in df_client dataframe
df_client.isnull().sum()

Customer_ID         0
Credit Score        3
Country             0
Gender              1
Age                 1
Tenure              0
Balance             0
NumOfProducts       0
HasCrCard?          0
IsActiveMember      0
Estimated Salary    2
ExitedFromBank?     0
dtype: int64

In [28]:
#View 3 missing values in Credit Score
df_nan = df_client[df_client['Credit Score'].isnull()==True]

In [29]:
df_nan

,Customer_ID,Credit Score,Country,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard?,IsActiveMember,Estimated Salary,ExitedFromBank?
204,15627801,NaN,ES,Male,33.0,3,"$176,666.62",1,1,0,"$94,670.77",0
214,15785542,NaN,DE,Male,26.0,4,"$118,287.01",2,0,0,NaN,0
976,15570060,NaN,France,Female,43.0,8,"$132,558.26",1,1,0,"$67,046.83",1

In [30]:
#Imput the mean Credit Score to replace NaN's
df_client_updated = df_client
df_client_updated['Credit Score']=df_client_updated['Credit Score'].fillna(df_client_updated['Credit Score'].mean())
df_client_updated.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 991 entries, 0 to 990
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Customer_ID       991 non-null    object
 1   Credit Score      991 non-null    float64
 2   Country           991 non-null    object
 3   Gender            990 non-null    object
 4   Age               990 non-null    float64
 5   Tenure            991 non-null    int64
 6   Balance           991 non-null    object
 7   NumOfProducts     991 non-null    int64
 8   HasCrCard?        991 non-null    int64
 9   IsActiveMember    991 non-null    int64
 10  Estimated Salary  989 non-null    object
 11  ExitedFromBank?   991 non-null    int64
dtypes: float64(2), int64(5), object(5)
memory usage: 93.0+ KB

In [32]:
#View missing values in Gender
df_nan = df_client[df_client['Gender'].isnull()==True]

In [33]:
df_nan

,Customer_ID,Credit Score,Country,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard?,IsActiveMember,Estimated Salary,ExitedFromBank?
11,15737173,497.0,Spain,NaN,24.0,3,$0.00,2,1,0,"$76,390.01",0

In [34]:
#Imput the mode Gender to replace NaN
df_client_updated = df_client
df_client_updated['Gender']=df_client_updated['Gender'].fillna(df_client_updated['Gender'].mode())

In [35]:
#View missing values in Age
df_nan = df_client[df_client['Age'].isnull()==True]

In [36]:
df_nan

,Customer_ID,Credit Score,Country,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard?,IsActiveMember,Estimated Salary,ExitedFromBank?
22,15699309,510.0,Spain,Female,NaN,4,$0.00,1,1,0,"$118,913.53",1

In [37]:
#Imput the median Age to replace NaN
df_client_updated = df_client
df_client_updated['Age']=df_client_updated['Age'].fillna(df_client_updated['Age'].median())

In [38]:
#Changing data type on column Age from a float to a number
df_client['Age'] = df_client['Age'].astype('int')

In [39]:
#View missing values in Estimated Salary
df_nan = df_client[df_client['Estimated Salary'].isnull()==True]

In [40]:
df_nan

,Customer_ID,Credit Score,Country,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard?,IsActiveMember,Estimated Salary,ExitedFromBank?
21,15597945,636.000000,Spain,Female,32,8,$0.00,2,1,0,NaN,0
214,15785542,648.512146,DE,Male,26,4,"$118,287.01",2,0,0,NaN,0

In [43]:
#Imput 0's in the Estimated Salary column to replace NaN
df_client_updated = df_client
df_client_updated['Estimated Salary']=df_client_updated['Estimated Salary'].fillna(0)

In [44]:
#Finding missing values in df_client dataframe
df_client.isnull().sum()

Customer_ID         0
Credit Score        0
Country             0
Gender              1
Age                 0
Tenure              0
Balance             0
NumOfProducts       0
HasCrCard?          0
IsActiveMember      0
Estimated Salary    0
ExitedFromBank?     0
dtype: int64

In [45]:
#View missing values in Gender
df_nan = df_client[df_client['Gender'].isnull()==True]

In [46]:
df_nan

,Customer_ID,Credit Score,Country,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard?,IsActiveMember,Estimated Salary,ExitedFromBank?
11,15737173,497.0,Spain,NaN,24,3,$0.00,2,1,0,"$76,390.01",0

In [48]:
df_client.mode()['Gender'][0]

'Male'

In [49]:
df_client_updated.head()

,Customer_ID,Credit Score,Country,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard?,IsActiveMember,Estimated Salary,ExitedFromBank?
0,15634602,619.0,France,Female,42,2,$0.00,1,1,1,"$101,348.88",1
1,15647311,608.0,Spain,Female,41,1,"$83,807.86",1,0,1,"$112,542.58",0
2,15619304,502.0,France,Female,42,8,"$159,660.80",3,1,0,"$113,931.57",1
3,15701354,699.0,France,Female,39,1,$0.00,2,0,0,"$93,826.63",0
4,15737888,850.0,Spain,Female,43,2,"$125,510.82",1,1,1,"$79,084.10",0

In [51]:
#Imput Male in the Gender column to replace NaN (Male is the mode gender)
df_client_updated = df_client
df_client_updated['Gender']=df_client_updated['Gender'].fillna('Male')

In [52]:
df_client_updated.head()

,Customer_ID,Credit Score,Country,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard?,IsActiveMember,Estimated Salary,ExitedFromBank?
0,15634602,619.0,France,Female,42,2,$0.00,1,1,1,"$101,348.88",1
1,15647311,608.0,Spain,Female,41,1,"$83,807.86",1,0,1,"$112,542.58",0
2,15619304,502.0,France,Female,42,8,"$159,660.80",3,1,0,"$113,931.57",1
3,15701354,699.0,France,Female,39,1,$0.00,2,0,0,"$93,826.63",0
4,15737888,850.0,Spain,Female,43,2,"$125,510.82",1,1,1,"$79,084.10",0

In [53]:
#Finding missing values in df_client dataframe
df_client.isnull().sum()

Customer_ID         0
Credit Score        0
Country             0
Gender              0
Age                 0
Tenure              0
Balance             0
NumOfProducts       0
HasCrCard?          0
IsActiveMember      0
Estimated Salary    0
ExitedFromBank?     0
dtype: int64

In [55]:
#Strip whitespace off column Estimated Salary
df_client['Estimated Salary'].str.strip()

0      $101,348.88
1      $112,542.58
2      $113,931.57
3       $93,826.63
4       $79,084.10
          ...
986     $79,616.37
987    $102,299.81
988    $104,533.51
989    $140,765.57
990     $66,214.13
Name: Estimated Salary, Length: 991, dtype: object

##Strip '$' and',' off the Estimated Salary Column.

In [57]:
df_client['Estimated Salary'] = df_client['Estimated Salary'].str.replace(',', '')
df_client['Estimated Salary'] = df_client['Estimated Salary'].str.replace('$', '')
df_client['Estimated Salary']

0      101348.88
1      112542.58
2      113931.57
3       93826.63
4       79084.10
          ...
986     79616.37
987    102299.81
988    104533.51
989    140765.57
990     66214.13
Name: Estimated Salary, Length: 991, dtype: object

In [58]:
#Changing data type on column Estimated Salary from a sting to a float
df_client['Estimated Salary'] = df_client['Estimated Salary'].astype('float')

##Strip '$' and',' off the Balance Column.

In [59]:
df_client['Balance'] = df_client['Balance'].str.replace(',', '')
df_client['Balance'] = df_client['Balance'].str.replace('$', '')
df_client['Balance']

0           0.00
1       83807.86
2      159660.80
3           0.00
4      125510.82
          ...
986    142120.91
987    151839.26
988    149620.88
989    168197.66
990     93147.00
Name: Balance, Length: 991, dtype: object

In [60]:
#Changing data type on column Balance from a sting to a float
df_client['Balance'] = df_client['Balance'].astype('float')

In [61]:
df_client.dtypes

Customer_ID          object
Credit Score        float64
Country              object
Gender               object
Age                   int32
Tenure                int64
Balance             float64
NumOfProducts         int64
HasCrCard?            int64
IsActiveMember        int64
Estimated Salary    float64
ExitedFromBank?       int64
dtype: object

In [62]:
#Changing data type on column HasCrCard? from a number to a string 
df_client['HasCrCard?'] = df_client['HasCrCard?'].astype('str')

In [63]:
#Changing data type on column IsActiveMember from a number to a string 
df_client['IsActiveMember'] = df_client['IsActiveMember'].astype('str')

In [64]:
#Changing data type on column ExitedFromBank? from a number to a string 
df_client['ExitedFromBank?'] = df_client['ExitedFromBank?'].astype('str')

In [65]:
df_client.dtypes

Customer_ID          object
Credit Score        float64
Country              object
Gender               object
Age                   int32
Tenure                int64
Balance             float64
NumOfProducts         int64
HasCrCard?           object
IsActiveMember       object
Estimated Salary    float64
ExitedFromBank?      object
dtype: object

In [66]:
df_client.head()

,Customer_ID,Credit Score,Country,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard?,IsActiveMember,Estimated Salary,ExitedFromBank?
0,15634602,619.0,France,Female,42,2,0.00,1,1,1,101348.88,1
1,15647311,608.0,Spain,Female,41,1,83807.86,1,0,1,112542.58,0
2,15619304,502.0,France,Female,42,8,159660.80,3,1,0,113931.57,1
3,15701354,699.0,France,Female,39,1,0.00,2,0,0,93826.63,0
4,15737888,850.0,Spain,Female,43,2,125510.82,1,1,1,79084.10,0

In [67]:
#Changing data type on column Credit Score from a float to a number
df_client['Credit Score'] = df_client['Credit Score'].astype('int')

In [68]:
df_client.dtypes

Customer_ID          object
Credit Score          int32
Country              object
Gender               object
Age                   int32
Tenure                int64
Balance             float64
NumOfProducts         int64
HasCrCard?           object
IsActiveMember       object
Estimated Salary    float64
ExitedFromBank?      object
dtype: object

In [69]:
df_client.head()

,Customer_ID,Credit Score,Country,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard?,IsActiveMember,Estimated Salary,ExitedFromBank?
0,15634602,619,France,Female,42,2,0.00,1,1,1,101348.88,1
1,15647311,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0
2,15619304,502,France,Female,42,8,159660.80,3,1,0,113931.57,1
3,15701354,699,France,Female,39,1,0.00,2,0,0,93826.63,0
4,15737888,850,Spain,Female,43,2,125510.82,1,1,1,79084.10,0

In [70]:
df_client['Country'].replace('FR', 'France', inplace=True)

In [71]:
df_client['Country'].replace('ES', 'Spain', inplace=True)

In [72]:
df_client['Country'].replace('DE', 'Germany', inplace=True)

In [73]:
print(df_client)

    Customer_ID  Credit Score Country  Gender  Age  Tenure    Balance  \
0      15634602           619  France  Female   42       2       0.00
1      15647311           608   Spain  Female   41       1   83807.86
2      15619304           502  France  Female   42       8  159660.80
3      15701354           699  France  Female   39       1       0.00
4      15737888           850   Spain  Female   43       2  125510.82
..          ...           ...     ...     ...  ...     ...        ...
986    15655339           566  France    Male   36       1  142120.91
987    15613749           569   Spain    Male   34       0  151839.26
988    15664521           659   Spain    Male   31       7  149620.88
989    15681206           722  France  Female   49       3  168197.66
990    15745527           655  France    Male   37       5   93147.00

     NumOfProducts HasCrCard? IsActiveMember  Estimated Salary ExitedFromBank?
0                1          1              1         101348.88               1
1                1          0              1         112542.58               0
2                3          1              0         113931.57               1
3                2          0              0          93826.63               0
4                1          1              1          79084.10               0
..             ...        ...            ...               ...             ...
986              1          1              0          79616.37               0
987              1          1              0         102299.81               1
988              2          1              1         104533.51               0
989              1          1              0         140765.57               1
990              2          1              0          66214.13               0

[991 rows x 12 columns]

In [74]:
df_client['Country'].value_counts(dropna=False)

Country
France     480
Germany    257
Spain      254
Name: count, dtype: int64

In [75]:
df_client['Age'].replace('2', '37', inplace=True)

In [76]:
df_client['Age'].value_counts(dropna=False)

Age
36    59
35    55
37    46
34    46
31    43
      ..
68     1
80     1
73     1
79     1
74     1
Name: count, Length: 61, dtype: int64

In [77]:
df_client.describe()

,Credit Score,Age,Tenure,Balance,NumOfProducts,Estimated Salary
count,991.000000,991.000000,991.000000,991.000000,991.000000,989.000000
mean,648.510595,38.683148,5.066599,78002.718063,1.522704,98574.543013
std,98.053952,10.952815,2.928371,62799.237345,0.573170,57224.716446
min,376.000000,2.000000,0.000000,0.000000,1.000000,371.050000
25%,580.000000,32.000000,2.000000,0.000000,1.000000,48559.190000
50%,653.000000,37.000000,5.000000,98668.180000,1.000000,98368.240000
75%,721.000000,44.000000,8.000000,129461.850000,2.000000,146326.450000
max,850.000000,82.000000,10.000000,213146.200000,4.000000,199725.390000

In [79]:
df_client['Estimated Salary'].value_counts(dropna=False)

Estimated Salary
NaN          2
101348.88    1
160941.78    1
9567.39      1
132210.49    1
            ..
174652.51    1
2010.98      1
14109.85     1
43527.40     1
66214.13     1
Name: count, Length: 990, dtype: int64

In [80]:
#Imput the median Estimated Salary to replace NaN
df_client_updated = df_client
df_client_updated['Estimated Salary']=df_client_updated['Estimated Salary'].fillna(df_client_updated['Estimated Salary'].median())

In [81]:
df_client_updated.describe()

,Credit Score,Age,Tenure,Balance,NumOfProducts,Estimated Salary
count,991.000000,991.000000,991.000000,991.000000,991.000000,991.00000
mean,648.510595,38.683148,5.066599,78002.718063,1.522704,98574.12666
std,98.053952,10.952815,2.928371,62799.237345,0.573170,57166.88523
min,376.000000,2.000000,0.000000,0.000000,1.000000,371.05000
25%,580.000000,32.000000,2.000000,0.000000,1.000000,48642.43500
50%,653.000000,37.000000,5.000000,98668.180000,1.000000,98368.24000
75%,721.000000,44.000000,8.000000,129461.850000,2.000000,146236.19000
max,850.000000,82.000000,10.000000,213146.200000,4.000000,199725.39000

In [82]:
df_client_updated['Estimated Salary'].value_counts(dropna=False)

Estimated Salary
98368.24     3
101348.88    1
160941.78    1
9567.39      1
132210.49    1
            ..
116828.51    1
174652.51    1
2010.98      1
14109.85     1
66214.13     1
Name: count, Length: 989, dtype: int64

In [83]:
#Finding missing values in df_client_updated dataframe
df_client_updated.isnull().sum()

Customer_ID         0
Credit Score        0
Country             0
Gender              0
Age                 0
Tenure              0
Balance             0
NumOfProducts       0
HasCrCard?          0
IsActiveMember      0
Estimated Salary    0
ExitedFromBank?     0
dtype: int64

In [89]:
#Check for mixed types
for column in df_client_updated.columns:
    print(column,':',pd.api.types.infer_dtype(df_client_updated[column]))

Customer_ID : string
Credit Score : integer
Country : string
Gender : string
Age : integer
Tenure : integer
Balance : floating
NumOfProducts : integer
HasCrCard? : string
IsActiveMember : string
Estimated Salary : floating
ExitedFromBank? : string

##There are no mixed data types.

In [87]:
#Finding duplicates
df_dups = df_client_updated[df_client_updated.duplicated()]

In [88]:
df_dups

Empty DataFrame
Columns: [Customer_ID, Credit Score, Country, Gender, Age, Tenure, Balance, NumOfProducts, HasCrCard?, IsActiveMember, Estimated Salary, ExitedFromBank?]
Index: []

##There are no duplicate records.

In [90]:
##Export final cleaned df_client_updated
df_client_updated.to_csv(os.path.join(path, '02 Data','Prepared Data', 'client_checked.csv'))